src/export-files/Documents/КадровоеПеремещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>КадровоеПеремещение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДвижениеСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗанимаемыхСтавок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/export-files/Documents/КадровоеПеремещение/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокСотрудниковСотрудникПриИзменении(Элемент)
	ДанныеСотрудника = ПолучитьДанныеСотрудника(Элементы.СписокСотрудников.ТекущиеДанные.Сотрудник);
	ЗанестиДанныеСотрудника(ДанныеСотрудника);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеСотрудника(Сотрудник)
	ДанныеСотрудника = Новый Структура;
	ДанныеСотрудника.Вставить("Подразделение", Сотрудник.Подразделение);
	ДанныеСотрудника.Вставить("Должность", Сотрудник.Должность);
	ДанныеСотрудника.Вставить("ЗанимаемыхСтавок", Сотрудник.ЗанимаемыхСтавок);
	ДанныеСотрудника.Вставить("ДатаНачалаРаботы", Сотрудник.ДатаНачалаРаботы);
	Возврат ДанныеСотрудника;
КонецФункции

&НаКлиенте
Процедура ЗанестиДанныеСотрудника(ДанныеСотрудника)
	Если ЗначениеЗаполнено(ДанныеСотрудника.Подразделение) Тогда
		Элементы.СписокСотрудников.ТекущиеДанные.Подразделение = ДанныеСотрудника.Подразделение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСотрудника.Должность) Тогда
		Элементы.СписокСотрудников.ТекущиеДанные.Должность = ДанныеСотрудника.Должность;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ДанныеСотрудника.ЗанимаемыхСтавок) Тогда
		Элементы.СписокСотрудников.ТекущиеДанные.ЗанимаемыхСтавок = ДанныеСотрудника.ЗанимаемыхСтавок;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСотрудника.ДатаНачалаРаботы) Тогда
		Элементы.СписокСотрудников.ТекущиеДанные.ДатаНачала = ДанныеСотрудника.ДатаНачалаРаботы;
	КонецЕсли;
КонецПроцедуры
